Revit 2027 API
BuiltInFailures.FabricFailures.WrongFabricSheetLayoutPattern Property
 The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongFabricSheetLayoutPattern { get; }
Public Shared ReadOnly Property WrongFabricSheetLayoutPattern As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongFabricSheetLayoutPattern {
	FailureDefinitionId^ get ();
}
static member WrongFabricSheetLayoutPattern : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace